flow-examples/class7/request1.xml

<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope" 
			   xmlns:dat="http://ws.wso2.org/dataservice">
   <soapenv:Header/>
   <soapenv:Body>
      <dat:mockDetail>
         <dat:nome>fulano1</dat:nome>
      </dat:mockDetail>
   </soapenv:Body>
</soapenv:Envelope>